package UITestingSprint_1;

public class Arrays {
    String[] buttons = {"Купить", "Снять", "Посуточно", "Новостройки"};// так выглядит массив: скоро ты научишься его создавать
    int[] digits = {0, 1, 2, 3, 4, 5, 6, 7, 8, 9};

    /**
     Как создать массив,
     Чтобы объявить массив, нужно:
     1. Указать тип значений, которые будут храниться в массиве: int, double, boolean, String или любой другой.
     2. Поставить квадратные скобки []. Именно они показывают, что перед нами массив.
     3. Указать имя массива. Например, buttons. Правила для имени массива те же самые, что и для переменной.
     4. Поставить оператор присваивания = и перечислить значения в фигурных скобках. Это называется инициализацией массива.
     */

}
