package UITesting.Sprint_2;

public class AccessModifiers {
    /**
        ```Модификатор - public```
     Он означает, что поле или метод класса доступны из любого другого класса.

        ```Модификатор private```
     Он означает, что обратиться к переменной или методу и изменить их можно только внутри того же класса.
     Например, приватную переменную нельзя изменить вне её класса.

        ```Модификатор по умолчанию (англ. default)```
     Он даёт доступ в пределах пакета, поэтому его ещё называют package-private.
     */

    /**
     * Как реализовать инкапсуляцию
     *
     * модификатор доступа private для поля класса,
     * публичные get- и set-методы.
     *
     * Геттеры получают значение переменной, а сеттеры — устанавливают новое
     */
}
